tests/test-results/artifacts/cart_state_3.json

{
  "data": {
    "id": "7",
    "type": "cart",
    "attributes": {
      "number": "R876714487",
      "item_total": "133.98",
      "total": "133.98",
      "ship_total": "0.0",
      "adjustment_total": "0.0",
      "created_at": "2025-04-11T03:16:00.250Z",
      "updated_at": "2025-04-11T03:16:01.161Z",
      "completed_at": null,
      "included_tax_total": "0.0",
      "additional_tax_total": "0.0",
      "display_additional_tax_total": "$0.00",
      "display_included_tax_total": "$0.00",
      "tax_total": "0.0",
      "currency": "USD",
      "state": "cart",
      "token": "nhi6NmnBcrSkLGtdweuQmA1744341360238",
      "email": null,
      "display_item_total": "$133.98",
      "display_ship_total": "$0.00",
      "display_adjustment_total": "$0.00",
      "display_tax_total": "$0.00",
      "promo_total": "0.0",
      "display_promo_total": "$0.00",
      "item_count": 2,
      "special_instructions": null,
      "display_total": "$133.98",
      "pre_tax_item_amount": "133.98",
      "display_pre_tax_item_amount": "$133.98",
      "pre_tax_total": "133.98",
      "display_pre_tax_total": "$133.98",
      "shipment_state": null,
      "payment_state": null,
      "public_metadata": {},
      "total_minus_store_credits": "133.98",
      "display_total_minus_store_credits": "$133.98",
      "subtotal_cents": 13398,
      "ship_total_cents": 0,
      "store_credit_total_cents": 0,
      "promo_total_cents": 0,
      "tax_total_cents": 0,
      "total_cents": 13398,
      "total_minus_store_credits_cents": 13398
    },
    "relationships": {
      "line_items": {
        "data": [
          {
            "id": "5",
            "type": "line_item"
          }
        ]
      },
      "variants": {
        "data": [
          {
            "id": "117",
            "type": "variant"
          }
        ]
      },
      "promotions": {
        "data": []
      },
      "payments": {
        "data": []
      },
      "shipments": {
        "data": []
      },
      "user": {
        "data": null
      },
      "billing_address": {
        "data": null
      },
      "shipping_address": {
        "data": null
      }
    }
  }
}